[
    {
        "Game Name": "1. The Legend of Zelda: Ocarina of Time",
        "Release Date": "Nov 23, 1998",
        "age_rating": "Rated E",
        "Game Summary": "As a young boy, Link is tricked by Ganondorf, the King of the Gerudo Thieves. The evil human uses Link to gain access to the Sacred Realm, where he places his tainted hands on Triforce and transforms the beautiful Hyrulean landscape into a barren wasteland. Link is determined to fix the problems he helped to create, so with the help of Rauru he travels through time gathering the powers of the Seven Sages.",
        "Metascore": "99"
    },
    {
        "Game Name": "2. SoulCalibur",
        "Release Date": "Sep 8, 1999",
        "age_rating": "Rated T",
        "Game Summary": "This is a tale of souls and swords, transcending the world and all its history, told for all eternity... The greatest weapons-based fighter returns, this time on Sega Dreamcast. Soul Calibur unleashes incredible graphics, fantastic fighters, and combos so amazing they'll make your head spin!",
        "Metascore": "98"
    },
    {
        "Game Name": "3. Grand Theft Auto IV",
        "Release Date": "Apr 29, 2008",
        "age_rating": "Rated M",
        "Game Summary": "[Metacritic's 2008 Xbox 360 Game of the Year; Also known as \"GTA IV\"]  What does the American Dream mean today? For Niko Belic, fresh off the boat from Europe. It's the hope he can escape his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and are dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them an a living nightmare for those who don't. [Rockstar Games]",
        "Metascore": "98"
    },
    {
        "Game Name": "4. Super Mario Galaxy",
        "Release Date": "Nov 12, 2007",
        "age_rating": "Rated E",
        "Game Summary": "[Metacritic's 2007 Wii Game of the Year] The ultimate Nintendo hero is taking the ultimate step ... out into space. Join Mario as he ushers in a new era of video games, defying gravity across all the planets in the galaxy. When some creature escapes into space with Princess Peach, Mario gives chase, exploring bizarre planets all across the galaxy. Mario, Peach and enemies new and old are here. Players run, jump and battle enemies as they explore all the planets in the galaxy. Since this game makes full use of all the features of the Wii Remote, players have to do all kinds of things to succeed: pressing buttons, swinging the Wii Remote and the Nunchuk, and even pointing at and dragging things with the pointer. Since he's in space, Mario can perform mind-bending jumps unlike anything he's done before. He'll also have a wealth of new moves that are all based around tilting, pointing and shaking the Wii Remote. Shake, tilt and point! Mario takes advantage of all the unique aspects of the Wii Remote and Nunchuk controller, unleashing new moves as players shake the controller and even point at and drag items with the pointer. [Nintendo]",
        "Metascore": "97"
    },
    {
        "Game Name": "5. Super Mario Galaxy 2",
        "Release Date": "May 23, 2010",
        "age_rating": "Rated E",
        "Game Summary": "Super Mario Galaxy 2, the sequel to the galaxy-hopping original game, includes the gravity-defying, physics-based exploration from the first game, but is loaded with entirely new galaxies and features to challenge players. On some stages, Mario can pair up with his dinosaur buddy Yoshi and use his tongue to grab items and spit them back at enemies. Players can also have fun with new items such as a drill that lets our hero tunnel through solid rock. [Nintendo]",
        "Metascore": "97"
    },
    {
        "Game Name": "6. The Legend of Zelda: Breath of the Wild",
        "Release Date": "Mar 3, 2017",
        "age_rating": "Rated E10+",
        "Game Summary": "Ignore everything you know about The Legend of Zelda games. Step into a world of discovery, exploration and adventure in The Legend of Zelda: Breath of the Wild. Travel across fields, through forests and to mountain peaks as you discover what has become of the ruined kingdom of Hyrule in this stunning open-air adventure. Explore the wilds of Hyrule any way you like - Climb up towers and mountain peaks in search of new destinations, then set your own path to get there and plunge into the wilderness. Along the way, you'll battle towering enemies, hunt wild beasts and gather ingredients for the food and elixirs you'll need to sustain you on your journey. More than 100 Shrines of Trials to discover and explore - Shrines dot the landscape, waiting to be discovered in any order you want. Search for them in various ways, and solve a variety of puzzles inside. Work your way through the traps and devices inside to earn special items and other rewards that will help you on your adventure. Be prepared and properly equipped - With an entire world waiting to be explored, you'll need a variety of outfits and gear to reach every corner. You may need to bundle up with warmer clothes or change into something better suited to the desert heat. Some clothing even has special effects that, for example, can make you faster and stealthier. [Nintendo]",
        "Metascore": "97"
    },
    {
        "Game Name": "7. Perfect Dark (2000)",
        "Release Date": "May 22, 2000",
        "age_rating": "Rated M",
        "Game Summary": "Step into the Dark... As Carrington Institute's most promising new Agent, Joanna Dark must uncover the truth behind the dataDyne Corporation's recent technological breakthroughs - breakthroughs which could have serious consequences for mankind.",
        "Metascore": "97"
    },
    {
        "Game Name": "8. Tony Hawk's Pro Skater 3",
        "Release Date": "Oct 30, 2001",
        "age_rating": "Rated T",
        "Game Summary": "Challenge up to four friends in online competitions over a LAN or the Internet.  Take them on in both Trick Attack and Graffiti modes. [Activision]",
        "Metascore": "97"
    },
    {
        "Game Name": "9. Red Dead Redemption 2",
        "Release Date": "Oct 26, 2018",
        "age_rating": "Rated M",
        "Game Summary": "Developed by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The end of the Wild West era has begun. After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang has to rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal fissures threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang that raised him. [Rockstar]",
        "Metascore": "97"
    },
    {
        "Game Name": "10. Grand Theft Auto V",
        "Release Date": "Nov 18, 2014",
        "age_rating": "Rated M",
        "Game Summary": "The sprawling sun-soaked metropolis of Los Santos is chock full of self-help coaches, starlets and C-List celebrities, once on top of the media world, now struggling to stay relevant in time of economic malaise and lowest-common-denominator reality TV. Amidst this madness, three unique criminals plan their own chances of survival and success: Franklin, a street-level hustler in search of opportunities for serious money; Michael, an ex-con whose \"retirement\" is a less rosy than he hoped it would be; and Trevor, a violent dude driven by the chance for a quick high and the next big score. Nearly out of options, the crew risks it all in a series of daring and dangerous heists that could set them up for life - one way or the other.",
        "Metascore": "97"
    },
    {
        "Game Name": "11. Metroid Prime",
        "Release Date": "Nov 17, 2002",
        "age_rating": "Rated T",
        "Game Summary": "Samus returns in a new mission to unravel the mystery behind the ruined walls scattered across Tallon IV. In Metroid Prime, you'll play the role of this bounty hunter and view the world through her visor, which displays information ranging from current energy levels to ammunition. Equipped with a Power Beam and Gravity Suit, you must shoot locked switches, solve puzzles, and eliminate enemies. It's up to you to explore the world and recover more power-ups and weapons, which gradually open more gameplay areas.",
        "Metascore": "97"
    },
    {
        "Game Name": "12. Grand Theft Auto III",
        "Release Date": "Oct 22, 2001",
        "age_rating": "Rated M",
        "Game Summary": "Players are put at the heart of their very own gangster movie, and let loose in a fully-realised 3 dimensional city with a cast of hundreds, 50 plus vehicles, ranging from sports cars to ice cream trucks and from boats to buses, 3 hours of music, including opera, reggae, house, drum and bass, pop and disco, and a huge array of street ready weapons.  [Rockstar Games]",
        "Metascore": "97"
    },
    {
        "Game Name": "13. Super Mario Odyssey",
        "Release Date": "Oct 27, 2017",
        "age_rating": "Rated E10+",
        "Game Summary": "New Evolution of Mario Sandbox-Style Gameplay. Mario embarks on a new journey through unknown worlds, running and jumping through huge 3D worlds in the first sandbox-style Mario game since Super Mario 64 and Super Mario Sunshine. Set sail between expansive worlds aboard an airship, and perform all-new actions, such as throwing Mario's cap.",
        "Metascore": "97"
    },
    {
        "Game Name": "14. Halo: Combat Evolved",
        "Release Date": "Nov 15, 2001",
        "age_rating": "Rated M",
        "Game Summary": "In a desperate attempt to keep a conquering alien race called the Covenant from finding Earth, you--a cybernteically enhanced soldier representing the peak of human military evolution--and a ragtag group of Marines flee to a distant uncharted system where you unexpectedly stumble across Halo, an enormous alien artifact in orbit between a gas giant and its moon. Your objective: Uncover Halo's horrible secret, and destroy mankind's nemesis - the Covenant. [Microsoft]",
        "Metascore": "97"
    },
    {
        "Game Name": "15. NFL 2K1",
        "Release Date": "Sep 7, 2000",
        "age_rating": "Rated E",
        "Game Summary": "In the end, NFL 2K1 is a deeper, more refined version of the original game.",
        "Metascore": "97"
    },
    {
        "Game Name": "16. Half-Life 2",
        "Release Date": "Nov 16, 2004",
        "age_rating": "Rated M",
        "Game Summary": "[Metacritic's 2004 PC Game of the Year]  By taking the suspense, challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player's presence affects everything around him, from the physical environment to the behaviors -- even the emotions -- of both friends and enemies. The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people -- people he cares about -- are counting on him. [Vivendi Universal]",
        "Metascore": "96"
    },
    {
        "Game Name": "17. BioShock",
        "Release Date": "Aug 21, 2007",
        "age_rating": "Rated M",
        "Game Summary": "[Metacritic's 2007 Xbox 360 Game of the Year] Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea. Constructed as an idealistic society for a hand picked group of scientists, artists and industrialists, the idealism is no more. Now the city is littered with corpses, wildly powerful guardians roam the corridors as little girls loot the dead, and genetically mutated citizens ambush you at every turn. Take control of your world by hacking mechanical devices, commandeering security turrets and crafting unique items critical to your very survival. Upgrade your weapons with ionic gels, explosives and toxins to customize them to the enemy and environment. Genetically modify your body through dozens of Plasmid Stations scattered throughout the city, empowering you with fantastic and often grotesque abilities. Explore a living world powered by Ecological A.I., where the inhabitants have interesting and consequential relationships with one another that impact your gameplay experience. Experience truly next generation graphics that vividly illustrate the forlorn art deco city, highlighted by the most detailed and realistic water effects ever developed in a video game. Make meaningful choices and mature decisions, ultimately culminating in the grand question: do you exploit the innocent survivors of Rapture...or save them? [2K Games]",
        "Metascore": "96"
    },
    {
        "Game Name": "18. GoldenEye 007",
        "Release Date": "Aug 25, 1997",
        "age_rating": "Rated T",
        "Game Summary": "You are Bond. James Bond. You are assigned covert operations connected with the GoldenEye weapons satellite. M will brief you on your mission and objectives from London. Q Branch will support your efforts with a plentiful supply of weapons and gadgets. Moneypenny offers you light-hearted best wishes and you're off! Your mission begins in the heavily guarded chemical warfare facility at the Byelomorye Dam in the USSR. Look and shoot in any direction as you navigate 12 interactive 3-D environments. Use stealth and force as you see fit in matters of international security. Consider the military personnel expendable. You are licensed to kill!",
        "Metascore": "96"
    },
    {
        "Game Name": "19. Uncharted 2: Among Thieves",
        "Release Date": "Oct 13, 2009",
        "age_rating": "Rated T",
        "Game Summary": "Fortune hunter Nathan Drake returns in Uncharted 2: Among Thieves, a third-person action-adventure/shooter created by award-winning developer Naughty Dog. Down on his luck, Drake is lured back into the treacherous world of thieves and mercenary treasure-seekers he had sought to leave behind. When a mysterious artifact propels Drake on an expedition to find the legendary Himalayan valley of Shambhala, he finds himself embroiled in a dangerous game of cat-and-mouse against a fugitive war criminal who’s after more than just the fabled riches of the lost city. Caught in a web of deception and plunged into an increasingly deadly pursuit that tests the limits of his endurance, Drake will be forced to risk everything - but has his luck finally run out? [SCEA]",
        "Metascore": "96"
    },
    {
        "Game Name": "20. Resident Evil 4 (2005)",
        "Release Date": "Jan 11, 2005",
        "age_rating": "Rated M",
        "Game Summary": "Resident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, you must make your way to a mysterious location in Europe, where new enemies await. Take them down by using enhanced aim-and-shoot features and a new action button.",
        "Metascore": "96"
    },
    {
        "Game Name": "21. Baldur's Gate 3",
        "Release Date": "Aug 3, 2023",
        "age_rating": "Rated M",
        "Game Summary": "An ancient evil has returned to Baldur's Gate, intent on devouring it from the inside out. The fate of Faerun lies in your hands. Alone, you may resist. But together, you can overcome. Gather your party and return to the Forgotten Realms in a tale of fellowship and betrayal, sacrifice and survival, and the lure of absolute power. Mysterious abilities are awakening inside you, drawn from a mind flayer parasite planted in your brain. Resist, and turn darkness against itself. Or embrace corruption, and become ultimate evil.",
        "Metascore": "96"
    },
    {
        "Game Name": "22. The Orange Box",
        "Release Date": "Oct 10, 2007",
        "age_rating": "Rated M",
        "Game Summary": "Games included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people - people he cares about - are counting on him. Half-Life 2: Episode One - The player reprises his role of Dr. Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx Vance and her robot, Dog, as they continue their support of the resistance's battle against the Combine forces.  Half-Life 2: Episode Two -- the second installment in Valve's episodic trilogy advances the award-winning story, leading the player to new locations outside of City 17. Portal - a pioneering type of single player action game that rewrites the rules for how players approach and manipulate their environment – much like how Half-Life 2's Gravity Gun reinvented the way gamers interact with objects in the game. Team Fortress 2 - an all-new version of the legendary title that spawned team based multiplayer action games. The game's daring new art style features the most advanced graphics of any Source-based game released to date. [Valve Software]",
        "Metascore": "96"
    },
    {
        "Game Name": "23. Tekken 3",
        "Release Date": "Apr 29, 1998",
        "age_rating": "Rated T",
        "Game Summary": "An ancient evil force has reawakened, attacking in secret and feeding on the souls of mighty warriors. To lure it out of hiding will take the greatest fighting contest the world has ever seen...Tekken 3. Some are fighting for revenge, some for honor, Ultimately, all are fighting for their lives and the fate of all mankind.",
        "Metascore": "96"
    },
    {
        "Game Name": "24. Mass Effect 2",
        "Release Date": "Jan 26, 2010",
        "age_rating": "Rated M",
        "Game Summary": "The Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make their mark on the galactic stage, are now faced with an even greater peril. [BioWare]",
        "Metascore": "96"
    }
]